Section 1: Python Basics/Section 1.org
#+TITLE: Section 1
#+SUBTITLE: Python Basics
#+AUTHOR: Mohammed Asir Shahid
#+EMAIL: MohammedShahid@protonmail.com
#+DATE: 2021-07-23

* Basic Terminology


#+begin_src python :results output :exports both
print(2+2)
#+end_src

#+RESULTS:
: 4

The above is an expression consisting of operators (such as the +) and values (such as the 2). Expressions always evaluate down to a single value.

#+begin_src python :results output :exports both
print(2)
print(5-3)
print(3*7)
print(22/7)
#+end_src

#+RESULTS:
: 2
: 2
: 21
: 3.142857142857143

The order of operations follow PEMDAS, so we can use parentheses in order to show what we really want.


#+begin_src python :results output :exports both
print(2+3*6)
print((2+3)*6)
#+end_src

#+RESULTS:
: 20
: 30

We can get errors when we mess things up

#+begin_src python :results output :exports both
print(5+)
#+end_src

#+RESULTS:

We can have strings and they can also be concatenated or replicated.

#+begin_src python :results output :exports both
print("Hello World")
print("Alice" + "Bob")
print("Alice"*3)
print("Hello" + "!"*10)
#+end_src

#+RESULTS:
: Hello World
: AliceBob
: AliceAliceAlice
: Hello!!!!!!!!!!

Python can store values inside of variables. Usually it is smart to name variables that describe the values that they contain. Variables can also be overwritten easily.

#+begin_src python :results output :exports both
spam=42
print(spam)
spam="Hello"
print(spam)
print(spam + " World")
#+end_src

#+RESULTS:
: 42
: Hello
: Hello World

Variables can also be set to different expressions. The expression will be evaluated and then that value will be set to the variable.

#+begin_src python :results output :exports both
spam=2+2
print(spam)
spam=10
print(spam)
spam=spam+1
print(spam)
#+end_src

#+RESULTS:
: 4
: 10
: 11

* Writing our First program

#+begin_src python :results output :exports both :tangle hello.py :file hello.py :var name=(read-string "What's your name? ") :var age=(read-string "What is your age? ")
# When using Python outside of org mode, we use a different way to get inputs
# name=input()

print("Hello World")

print("What is your name?")

print("It is good to meet you, {}".format(name))
# Alternatively, we could concatenate
# print("It is good to meet you, " + name)
print("The length of your name is: {}".format(str(len(name))))

print("You will be {} in a year".format(str(int(age)+1)))
#+end_src

#+RESULTS:
: Hello World
: What is your name?
: It is good to meet you, Asir
: The length of your name is: 4
: You will be 23 in a year
